nxp-appcodehub/dm-nafe13388-application-examples/examples_CLI/TwoWireRTD/FRDM_MCXN947/NAFE/NAFE113x8_SDK.c
/*
 * NAFE113x8_SDK.c
 * Copyright 2024 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

#include "NAFE113x8_Register.h"
#include "NAFE113x8_SDK.h"
#include "fsl_debug_console.h"
#include "systick_utils.h"

static uint8_t NAFE113x8_CaptureSamplesSCCR(uint16_t count);
static void NAFE113x8_CaptureSamplesMCMR(uint16_t activeChannelCount, bool dataOut16, bool statusByteEn);
void NAFE113x8_DELAY_ms(uint32_t delay_ms);
static uint8_t NAFE113x8_CountChannelsEnabled();

// Buffer used to store Rx Even bytes directly by DMA
AT_NONCACHEABLE_SECTION_INIT(uint8_t rx_bufEven[bufferDMASize]);
// Buffer used to store Rx Odd bytes directly by DMA
AT_NONCACHEABLE_SECTION_INIT(uint8_t rx_bufOdd[bufferDMASize]);


// SPI1 Rx DMA Handle.
edma_handle_t LP_FLEXCOMM1_RX_Handle;
// SPI1 Tx DMA Handle for Command.
edma_handle_t LP_FLEXCOMM1_TXCmd_Handle;
// SPI1 Tx DMA Handle (triggered by DRDY) used to transmit dummy bytes.
edma_handle_t LP_FLEXCOMM1_TXDummy_Handle;
// SPI1 Tx DMA Handle (triggered by SPI1 TxRequest) used to transmit dummy bytes.
edma_handle_t LP_FLEXCOMM1_TXDummy2_Handle;

// Flag used to sync with DMA process.
volatile bool SampleReceived = false;

// Counter used to keep track of processed sample.
uint32_t samplesBuffer[2048*16];
// Address of SPI1 Tx FIFO
uint32_t TxSpi1Adr;
// Address of SPI1 Rx FIFO
uint32_t RxSpi1Adr;

void NAFE113x8_InitNafe (){

	// Configuration for SPI1
	const lpspi_master_config_t LP_FLEXCOMM1_config = {
		.baudRate = 11000000UL,
		.bitsPerFrame = 8UL,
		.cpol = kLPSPI_ClockPolarityActiveHigh,
		.cpha = kLPSPI_ClockPhaseSecondEdge,
		.direction = kLPSPI_MsbFirst,
		.pcsToSckDelayInNanoSec = 50UL,
		.lastSckToPcsDelayInNanoSec = 50UL,
		.betweenTransferDelayInNanoSec = 50UL,
		.whichPcs = LPSPI1_PCS,
		.pcsActiveHighOrLow = kLPSPI_PcsActiveLow,
		.pinCfg = kLPSPI_SdiInSdoOut,
		.pcsFunc = kLPSPI_PcsAsCs,
		.dataOutConfig = kLpspiDataOutRetained,
		.enableInputDelay = false
	};

	// Base Configuration for DMA0
	edma_config_t DMA0_config = {
		.enableMasterIdReplication = false,
		.enableGlobalChannelLink = true,
		.enableHaltOnError = true,
		.enableDebugMode = false,
		.enableRoundRobinArbitration = false
	};

	// Clear DMA configuration for all channels
	memset(DMA0_config.channelConfig, 0, FSL_FEATURE_EDMA_INSTANCE_CHANNELn(DMA0_DMA_BASEADDR) * sizeof(edma_channel_config_t *));

	// Clear DMA buffers.
	memset(rx_bufEven, 0, bufferDMASize*sizeof(*rx_bufEven));
	memset(rx_bufOdd, 0, bufferDMASize*sizeof(*rx_bufOdd));

	// SPI1 Init
	LPSPI_MasterInit(LP_FLEXCOMM1_PERIPHERAL, &LP_FLEXCOMM1_config, LP_FLEXCOMM1_CLOCK_FREQ);
	// SPI1 Set COnfigure Select
	LPSPI_SelectTransferPCS(LP_FLEXCOMM1_PERIPHERAL, LPSPI1_PCS);
	// SPI1 Enable
	LPSPI_Enable(LP_FLEXCOMM1_PERIPHERAL,1);
	// SPI1 Save Tx FIFO Address
	TxSpi1Adr = LPSPI_GetTxRegisterAddress(LP_FLEXCOMM1_PERIPHERAL);
	// SPI1 Save Rx FIFO Address
	RxSpi1Adr = LPSPI_GetRxRegisterAddress(LP_FLEXCOMM1_PERIPHERAL);

	//DMA0 initiation
	EDMA_Init(DMASPI1,&DMA0_config);

	// Set DMA Rx Request source to Flexcomm1 Rx.
	EDMA_SetChannelMux(DMASPI1,DMASPI1_CHRx,kDma0RequestMuxLpFlexcomm1Rx);
	EDMA_CreateHandle(&LP_FLEXCOMM1_RX_Handle,DMASPI1,DMASPI1_CHRx);
	// Set DMA Command Tx Request source to none(SW).
	EDMA_SetChannelMux(DMASPI1,DMASPI1_CHTxCmd,0);
	EDMA_CreateHandle(&LP_FLEXCOMM1_TXCmd_Handle,DMASPI1,DMASPI1_CHTxCmd);
	// Set DMA Dummy Tx Request Source to DRDY edge interrupt.
	EDMA_SetChannelMux(DMASPI1,DMASPI1_CHTxDummy,kDma0RequestMuxGpio0PinEventRequest0);
	EDMA_CreateHandle(&LP_FLEXCOMM1_TXDummy_Handle,DMASPI1,DMASPI1_CHTxDummy);
	// Set DMA Dummy2 Tx Request Source to Flexcomm1.
	EDMA_SetChannelMux(DMASPI1,DMASPI1_CHTxDummy2,kDma0RequestMuxLpFlexcomm1Tx);
	EDMA_CreateHandle(&LP_FLEXCOMM1_TXDummy2_Handle,DMASPI1,DMASPI1_CHTxDummy2);
}


void NAFE113x8_WriteCommand(uint16_t command, bool devID){

	// Tx Buffer with Command ID
	uint8_t txData[]={NAFE113x8_SPI_CMD_FORMAT_BYTE1(command), NAFE113x8_SPI_CMD_FORMAT_BYTE0(devID,command)};
	// Rx Dummy Buffer
	uint8_t rxData[2];
	// SPI Transaction description
	lpspi_transfer_t txref={txData,rxData,2,kLPSPI_MasterPcsContinuous|LPSPI1_PCS};
	// SPI Transaction Frame Size - 2 bytes in case of NAFE command format
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, 16);
	// Start a blocking SPI Transaction.
	LPSPI_MasterTransferBlocking(LP_FLEXCOMM1_PERIPHERAL,&txref);
	// Reset to default SPI Transaction Frame Size
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, 8);
}


void NAFE113x8_ReadRegister(const Register_t *RegDef, bool devID, uint32_t *regValue){

	// Tx Buffer with Register addressing plus 3 bytes to read back the value.
	uint8_t txData[]={NAFE113x8_SPI_READ_FORMAT_BYTE0(devID,RegDef->Address),
		NAFE113x8_SPI_READ_FORMAT_BYTE1(RegDef->Address),
		0,0,0};
	// Rx Buffer.
	uint8_t rxData[]={0,0,0,0,0};
	// SPI Transaction description
	lpspi_transfer_t txref={txData,rxData,(2 + RegDef->Bytes),kLPSPI_MasterPcsContinuous|LPSPI1_PCS|kLPSPI_MasterByteSwap};

	// SPI Transaction Frame Size - 2 or 3 bytes according to register size.
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, (2 + RegDef->Bytes) * 8);
	// Start a blocking SPI Transaction.
	LPSPI_MasterTransferBlocking(LP_FLEXCOMM1_PERIPHERAL,&txref);
	// Reset to default SPI Transaction Frame Size
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, 8);

	// Decode and store into regValue the register content.
	if (RegDef->Bytes == 2)
		*regValue = (rxData[2]<<8) | (rxData[3]);
	else
		*regValue = (rxData[2]<<16) | (rxData[3]<<8) | rxData[4];

}

void NAFE113x8_WriteRegister(const Register_t *RegDef, bool devID, uint32_t regValue){

	// Rx Dummy Buffer
	uint8_t rxData[5];
	// Tx Buffer with Register addressing plus 3 bytes for data.
	uint8_t txData[]={NAFE113x8_SPI_WRITE_FORMAT_BYTE0(devID,RegDef->Address),
		NAFE113x8_SPI_WRITE_FORMAT_BYTE1(RegDef->Address),
		0,0,0};
	// SPI Transaction description
	lpspi_transfer_t txref={txData,rxData,(2 + RegDef->Bytes),kLPSPI_MasterPcsContinuous|LPSPI1_PCS|kLPSPI_MasterByteSwap};

	// Decode and store into Tx Buffer according to register size.
	if (RegDef->Bytes == 2){
		txData[2] = (regValue>>8)&0xFF;
		txData[3] = (regValue>>0)&0xFF;
	}
	else{
		txData[2] = (regValue>>16)&0xFF;
		txData[3] = (regValue>>8)&0xFF;
		txData[4] = (regValue>>0)&0xFF;
	}

	// SPI Transaction Frame Size - 2 or 3 bytes according to register size.
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, (2 + RegDef->Bytes) * 8);
	// Start a blocking SPI Transaction.
	LPSPI_MasterTransferBlocking(LP_FLEXCOMM1_PERIPHERAL,&txref);
	// Reset to default SPI Transaction Frame Size
	LPSPI_SetFrameSize(LP_FLEXCOMM1_PERIPHERAL, 8);
}

void NAFE113x8_WriteField(const Field_t *FieldDef, bool devID, uint16_t fieldValue){

	assert(!(FieldDef->r_w == Read));
	assert((FieldDef->mask&fieldValue) == fieldValue);

