nxp-appcodehub/dm-nafe13388-application-examples/examples_CLI/TwoWireRTD/FRDM_MCXN947/NAFE/NAFE113x8_SDK.c
	// Variable to store register value.
	uint32_t readBack;

	// Read Register Value
	NAFE113x8_ReadRegister(FieldDef->refRegister,devID,&readBack);

	// Apply new value according to old register content and register mask.
	readBack &= ~((FieldDef->mask)<<FieldDef->Offset);
	readBack |= fieldValue<<(FieldDef->Offset);

	// Update register value.
	NAFE113x8_WriteRegister(FieldDef->refRegister, devID, readBack);
}

void NAFE113x8_ReadField(const Field_t *FieldDef, bool devID, uint16_t *fieldValue){
	assert(!(FieldDef->r_w == Write));

	// Variable to store register value.
	uint32_t readBack;
	// Read Register Value
	NAFE113x8_ReadRegister(FieldDef->refRegister,devID,&readBack);
	// Apply mask to extract the request field
	*fieldValue = (readBack>>FieldDef->Offset)&(FieldDef->mask);
}


void NAFE113x8_selectChannel(uint8_t channel, bool devID){
	uint16_t cmd;
	switch (channel){
		case 0:
			cmd = CMD_CH0;
			break;
		case 1:
			cmd = CMD_CH1;
			break;
		case 2:
			cmd = CMD_CH2;
			break;
		case 3:
			cmd = CMD_CH3;
			break;
		case 4:
			cmd = CMD_CH4;
			break;
		case 5:
			cmd = CMD_CH5;
			break;
		case 6:
			cmd = CMD_CH6;
			break;
		case 7:
			cmd = CMD_CH7;
			break;
		case 8:
			cmd = CMD_CH8;
			break;
		case 9:
			cmd = CMD_CH9;
			break;
		case 10:
			cmd = CMD_CH10;
			break;
		case 11:
			cmd = CMD_CH11;
			break;
		case 12:
			cmd = CMD_CH12;
			break;
		case 13:
			cmd = CMD_CH13;
			break;
		case 14:
			cmd = CMD_CH14;
			break;
		case 15:
			cmd = CMD_CH15;
			break;
		default:
			return;
	}
	NAFE113x8_WriteCommand(cmd,devID);
}

static uint8_t NAFE113x8_CountChannelsEnabled(){

	// Variable to store the value of Config4 Register
	uint32_t activeChannelMask;
	// Counter for channels enabled.
	uint16_t activeChannelCount=0;

	NAFE113x8_ReadRegister(&ChConfig4,0,&activeChannelMask);

	// Count the current active channels.
	while (activeChannelMask){
		activeChannelCount += activeChannelMask&1;
		activeChannelMask>>=1;
	}

	return activeChannelCount;
}

static uint8_t NAFE113x8_CaptureSamplesSCCR(uint16_t count){
	uint16_t sampleCount = 0;
	int ret = SUCCESS;

	while (sampleCount <count){
		/* Delay of 1 second to wait for sample received flag to be set */
		NAFE113x8_DELAY_ms(1000);

		if(SampleReceived){
			SampleReceived=false;
			if(sampleCount%2==0)
				samplesBuffer[sampleCount]=((rx_bufEven[0])<<16)|((rx_bufEven[1])<<8)|rx_bufEven[2];
			else{
				samplesBuffer[sampleCount]=((rx_bufOdd[0])<<16)|((rx_bufOdd[1])<<8)|rx_bufOdd[2];
			}
			sampleCount++;
		}
		else{
			ret = TIMEOUT;
			PRINTF("\r\nSample not received, Trying Again!!\r\n");
			break;
		}
	}
	return ret;
}

static void NAFE113x8_CaptureSamplesMCMR(uint16_t activeChannelCount, bool dataOut16, bool statusByteEn){
	while (!SampleReceived);
	for (int i=0; i<activeChannelCount;i++) {
		if (dataOut16)
			samplesBuffer[i]=((rx_bufEven[0])<<16)|((rx_bufEven[1])<<8)|rx_bufEven[2]; // TODO
		else
			samplesBuffer[i]=((rx_bufEven[3*i])<<16)|((rx_bufEven[(3*i)+1])<<8)|rx_bufEven[(3*i)+2];
	}
}

static uint8_t NAFE113x8_CaptureSamplesMCCR(uint16_t activeChannelCount, bool dataOut16, bool statusByteEn, uint16_t count){
	uint16_t sampleCount = 0;
	int ret = SUCCESS;

	while (sampleCount <count){
		/* Delay of 1 second to wait for sample received flag to be set */
		NAFE113x8_DELAY_ms(1000);

		if (SampleReceived){
			SampleReceived=false;
			for (int i=0; i<activeChannelCount;i++) {
				if (dataOut16)
					samplesBuffer[i]=((rx_bufEven[0])<<16)|((rx_bufEven[1])<<8)|rx_bufEven[2]; // TODO
				else{
					if(sampleCount%2==0)
						samplesBuffer[(activeChannelCount * sampleCount) + i]=((rx_bufEven[3*i])<<16)|((rx_bufEven[(3*i)+1])<<8)|rx_bufEven[(3*i)+2];
					else
						samplesBuffer[(activeChannelCount * sampleCount) + i]=((rx_bufOdd[3*i])<<16)|((rx_bufOdd[(3*i)+1])<<8)|rx_bufOdd[(3*i)+2];
				}
			}
			sampleCount++;
		}
		else{
			ret = TIMEOUT;
			PRINTF("\r\nSample not received, Trying Again!!\r\n");
			break;
		}
	}
	return ret;
}

void NAFE113x8_DELAY_ms(uint32_t delay_ms)
{
	int32_t start, elapsed;
	uint32_t systemCoreClock = CLOCK_GetFreq(kCLOCK_CoreSysClk);

	BOARD_SystickStart(&start);
	do // Loop for requested number of ms.
	{
		elapsed = BOARD_SystickElapsedTicks(&start);
	} while((COUNT_TO_MSEC(elapsed, systemCoreClock) < delay_ms) && !SampleReceived);
}

float NAFE113x8_VoltageTranslation(uint32_t value, uint8_t input , bool dataOut16, float gain){
	int sInt;
	float ConvertedValue;

	if (dataOut16){
		sInt = ((value + 0x10000) % (0x8000)) - 0x10000;
		ConvertedValue = 0.000152587 * sInt;
	}
	else
	{
		sInt = ((value + 0x800000) % (0x1000000)) - 0x800000;
		ConvertedValue = 0.000000596 * sInt;
	}

	switch(input){
		case(GPIO0_1):
			ConvertedValue = ConvertedValue/2.5;
			break;
		case(REF2):
		case(VADD):
			ConvertedValue = ConvertedValue/2.5;
			ConvertedValue = 2*(ConvertedValue+1.5);
			break;
		case(VHDD):
			ConvertedValue = ConvertedValue/2.5;
			ConvertedValue = 32*(ConvertedValue+0.25);
			break;
		case(VHSS):
			ConvertedValue = ConvertedValue/2.5;
			ConvertedValue = -1*32*(ConvertedValue-0.25);
			break;
		default:
			ConvertedValue = ConvertedValue/gain;
			break;
	}
	return ConvertedValue;
}

uint32_t NAFE113x8_getSample(uint16_t index){
	return samplesBuffer[index];
}

uint8_t NAFE113x8_doSCCR(uint8_t channel, bool devID, uint16_t count){

	// Dummy variable to use as 0 value.
	uint8_t dummyTx = 0;
	// Dummy variable to use as dummy pointer.
	uint8_t dummyRx = 0;
	// Variable used to describe the TCD for all TCDs.
	edma_transfer_config_t edma_tc_description;
	// Buffer used to store Tx Command.
	AT_NONCACHEABLE_SECTION_INIT(uint8_t tx_buf[2]);

	// TCD triggered by software, used to send the start cmd.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_cmd, EDMA_TCD_ALIGN_SIZE);
	// TCD triggered by DRDY, used to send the dummy bytes to clock the slave to return the converted value.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_txDummy, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to handle the dummy value returned by the tcd_cmd DMA transaction.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxDummy, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to store the Even Bytes,  this is active at the end of the previous one (tcd_rxDummy).
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxEven, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to store the Odd Bytes,  this is active at the end of the previous one (tcd_rxDummy).
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxOdd, EDMA_TCD_ALIGN_SIZE);

