nxp-appcodehub/dm-nafe13388-application-examples/examples_CLI/TwoWireRTD/FRDM_MCXN947/NAFE/NAFE113x8_SDK.c
			MajorLoopCount_tcd_rx = activeChannelCount*3;
			MinorLoopCount_tcd_rx = 1;
			break;
	}

	// Decode and store the request command into transmit buffer.
	tx_buf[0]=NAFE113x8_SPI_CMD_FORMAT_BYTE0(0,CMD_MM);
	tx_buf[1]=NAFE113x8_SPI_CMD_FORMAT_BYTE1(CMD_MM);

	// Clear LPSPI Flags and FIFOs
	LPSPI_FlushFifo(LP_FLEXCOMM1_PERIPHERAL, true, true);
	LPSPI_ClearStatusFlags(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_AllStatusFlag);
	LPSPI_DisableInterrupts(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_AllInterruptEnable);
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_RxDmaEnable | (uint32_t)kLPSPI_TxDmaEnable);

	// TCD configurations common to all the TCDs described below.
	edma_tc_description.srcAddrModulo=kEDMA_ModuloDisable;
	edma_tc_description.dstAddrModulo=kEDMA_ModuloDisable;
	edma_tc_description.enableChannelMinorLoopLink=false;
	edma_tc_description.enableChannelMajorLoopLink=false;
	edma_tc_description.srcTransferSize=kEDMA_TransferSize1Bytes;
	edma_tc_description.destTransferSize=kEDMA_TransferSize1Bytes;
	edma_tc_description.enableDstMinorLoopOffset = false;
	edma_tc_description.enableSrcMinorLoopOffset = false;
	edma_tc_description.dstMajorLoopOffset = 0;
	edma_tc_description.srcMajorLoopOffset = 0;

	// TCD triggered by SW configuration.
	edma_tc_description.srcAddr=(uint32_t)tx_buf;
	edma_tc_description.srcOffset=1;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=2;
	edma_tc_description.majorLoopCounts=1;
	edma_tc_description.enabledInterruptMask=0;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_cmd);
	EDMA_ConfigChannelSoftwareTCD(&tcd_cmd, &edma_tc_description);

	// TCD triggered by Rx Flexcomm request for dummyRx (link to tcd_rx).
	edma_tc_description.srcAddr=RxSpi1Adr;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=(uint32_t)&dummyRx;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=1;
	edma_tc_description.majorLoopCounts=2;
	edma_tc_description.enabledInterruptMask= 0;
	edma_tc_description.linkTCD = &tcd_rx;
	EDMA_TcdReset(&tcd_rxDummy);
	EDMA_ConfigChannelSoftwareTCD(&tcd_rxDummy, &edma_tc_description);

	// TCD triggered by DRDY.
	edma_tc_description.srcAddr=(uint32_t)&dummyTx;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_txDummy;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_txDummy;
	edma_tc_description.enabledInterruptMask=tcd_txDummy_Interrupt;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_txDummy);
	EDMA_ConfigChannelSoftwareTCD(&tcd_txDummy, &edma_tc_description);

	// TCD triggered by Tx FlexComm request, this is started only when Major loop of tcd_txDummy expire.
	edma_tc_description.srcAddr=(uint32_t)&dummyTx;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_txDummy2;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_txDummy2;
	edma_tc_description.enabledInterruptMask=0;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_txDummy2);
	EDMA_ConfigChannelSoftwareTCD(&tcd_txDummy2, &edma_tc_description);

	// TCD triggered by Rx Flexcomm request for store the Rx bytes (start when Major loop of tcd_rxDummy expire).
	edma_tc_description.srcAddr=RxSpi1Adr;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=(uint32_t)&rx_bufEven[0];
	edma_tc_description.destOffset=1;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_rx;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_rx;
	edma_tc_description.enabledInterruptMask= kEDMA_MajorInterruptEnable;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_rx);
	EDMA_ConfigChannelSoftwareTCD(&tcd_rx, &edma_tc_description);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxCmd, &tcd_cmd);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxCmd, true);

	// Install TCD and Disable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHRx, &tcd_rxDummy);
	EDMA_EnableAutoStopRequest(DMASPI1, 0, false);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxDummy, &tcd_txDummy);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxDummy, true);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxDummy2, &tcd_txDummy2);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxDummy2, true);

	EnableIRQ(EDMA_0_CH0_IRQn);//IRQ needed to sync with received samples.
	EnableIRQ(EDMA_0_CH2_IRQn);//IRQ needed to start tcd_txDummy2 if needed.

	// Clear all interrupt flag for all DMA CH.
	EDMA_ClearChannelStatusFlags(DMA0,0,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,1,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,2,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,3,kEDMA_InterruptFlag);

	// Enable DMA for LPSPI1.
	LPSPI_EnableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_RxDmaEnable);
	LPSPI_EnableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_TxDmaEnable);

	// Set PCS in continuos mode, CS remain low till the end of trasmission.
	LPSPI_SetPCSContinous(LP_FLEXCOMM1_PERIPHERAL,1);

	EDMA_StartTransfer(&LP_FLEXCOMM1_RX_Handle);
	EDMA_StartTransfer(&LP_FLEXCOMM1_TXDummy_Handle);
	EDMA_TriggerChannelStart(DMASPI1, DMASPI1_CHTxCmd);

	NAFE113x8_CaptureSamplesMCMR(activeChannelCount,false,false);

	// Set PCS at the end of trasmission.
	LPSPI_SetPCSContinous(LP_FLEXCOMM1_PERIPHERAL,0);
	// Stop the DMA channel, the only channel with the autostop disable.
	EDMA_StopTransfer(&LP_FLEXCOMM1_RX_Handle);
	// Disable DMA for LPSPI1.
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_RxDmaEnable);
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_TxDmaEnable);
	DisableIRQ(EDMA_0_CH0_IRQn);
	DisableIRQ(EDMA_0_CH2_IRQn);
	//Clear Flag
	SampleReceived = false;
}

uint8_t NAFE113x8_doMCCR(bool devID, uint16_t count){

	// Variable to store the interrupt behavior for Tx Dummy TCD.
	uint32_t tcd_txDummy_Interrupt;
	// Dummy variable to use as 0 value.
	uint8_t dummyTx = 0;
	// Dummy variable to use as dummy pointer.
	uint8_t dummyRx = 0;
	// Major Loop Count for Tx Dummy TCD.
	uint8_t MajorLoopCount_tcd_txDummy = 0;
	// Minor Loop Count for Tx Dummy TCD.
	uint8_t MinorLoopCount_tcd_txDummy = 0;
	// Major Loop Count for Tx Dummy second TCD.
	uint8_t MajorLoopCount_tcd_txDummy2 = 0;
	// Minor Loop Count for Tx Dummy second TCD.
	uint8_t MinorLoopCount_tcd_txDummy2 = 0;
	// Major Loop Count for Rx TCD.
	uint8_t MajorLoopCount_tcd_rx = 0;
	// Minor Loop Count for Rx TCD.
	uint8_t MinorLoopCount_tcd_rx = 0;
	// Variable to store the DRDY_PIN_EDGE value.
	uint16_t drdyEdgeMode=0;
	// Variable to store the active channel count.
	uint16_t activeChannelCount=0;
	// Variable used to describe the TCD for all TCDs.
	edma_transfer_config_t edma_tc_description;
	// Buffer used to store Tx Command.
	AT_NONCACHEABLE_SECTION_INIT(uint8_t tx_buf[2]);

	// TCD triggered by software, used to send the start cmd.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_cmd, EDMA_TCD_ALIGN_SIZE);
	// TCD triggered by DRDY, used to send the dummy bytes to clock the slave to return the converted value.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_txDummy, EDMA_TCD_ALIGN_SIZE);
	/* TCD triggered by FlexcommTx, used to send the dummy bytes to clock the slave to return the converted value.
	   This TCD is used in case tcd_txDummy could risk filling the entire SPI FIFO */
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_txDummy2, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to handle the dummy value returned by the tcd_cmd DMA transaction.
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxDummy, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to store the Conversion Data,  this is active at the end of the previous one (tcd_rxDummy).
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxEven, EDMA_TCD_ALIGN_SIZE);
	// TCD Triggered by FlexcommRx used to store the Conversion Data..
	AT_NONCACHEABLE_SECTION_ALIGN(edma_tcd_t tcd_rxOdd, EDMA_TCD_ALIGN_SIZE);


	activeChannelCount = NAFE113x8_CountChannelsEnabled();

	NAFE113x8_ReadField(&SysConfig0_DrdyPinEdge,0,&drdyEdgeMode);
	switch(drdyEdgeMode){

		case DRDYPINEDGE_EVERYCH:
			/* Configuration of TCDs in case of DRDY is issued for every CH conversion
			 * DMA write 3 bytes (value 0) each DRDY pulse
			 * NO interrupt at the expiration of tcd_txDummy
			 * tcd_rx need to store 3 bytes for each active channels */

			MajorLoopCount_tcd_txDummy = activeChannelCount * count;
			MinorLoopCount_tcd_txDummy = 3;
			MajorLoopCount_tcd_rx = 3 * activeChannelCount;
			MinorLoopCount_tcd_rx = 1;
			tcd_txDummy_Interrupt = 0;

			break;

		case DRDYPINEDGE_LASTCH:

			if (activeChannelCount<3){
				/* Configuration of TCDs in case of DRDY is issued at the end of all ch conversion,
				 * there is no risk of overflow the FIFO.
				 * DMA write activeChannelCount*3 bytes (value 0) after DRDY.
				 * NO interrupt at the expiration of tcd_txDummy  */

