nxp-appcodehub/dm-nafe13388-application-examples/examples_CLI/TwoWireRTD/FRDM_MCXN947/NAFE/NAFE113x8_SDK.c
				MajorLoopCount_tcd_txDummy = 1 * count;
				MinorLoopCount_tcd_txDummy = activeChannelCount*3;
				tcd_txDummy_Interrupt = 0;
			}
			else{
				/* Configuration of TCDs in case of DRDY is issued at the end of all ch conversion,
				 * there is risk of overflow the FIFO.
				 * DMA write 6 bytes (value 0) after DRDY with tcd_txDummy .
				 * DMA write remaining bytes (value 0) at each FlexcommTx Request with tcd_txDummy2.
				 * An interrupt at the expiration of tcd_txDummy is issued to start the tcd_txDummy2 */

				MajorLoopCount_tcd_txDummy = 1;
				MinorLoopCount_tcd_txDummy = 2 * 3;
				MajorLoopCount_tcd_txDummy2 = (activeChannelCount-2)*3;
				MinorLoopCount_tcd_txDummy2 = 1;
				tcd_txDummy_Interrupt = kEDMA_MajorInterruptEnable;
			}

			MajorLoopCount_tcd_rx = activeChannelCount*3;
			MinorLoopCount_tcd_rx = 1;
			break;
	}

	// Decode and store the request command into transmit buffer.
	tx_buf[0]=NAFE113x8_SPI_CMD_FORMAT_BYTE0(0,CMD_MC);
	tx_buf[1]=NAFE113x8_SPI_CMD_FORMAT_BYTE1(CMD_MC);

	// Clear LPSPI Flags and FIFOs
	LPSPI_FlushFifo(LP_FLEXCOMM1_PERIPHERAL, true, true);
	LPSPI_ClearStatusFlags(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_AllStatusFlag);
	LPSPI_DisableInterrupts(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_AllInterruptEnable);
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL, (uint32_t)kLPSPI_RxDmaEnable | (uint32_t)kLPSPI_TxDmaEnable);

	// TCD configurations common to all the TCDs described below.
	edma_tc_description.srcAddrModulo=kEDMA_ModuloDisable;
	edma_tc_description.dstAddrModulo=kEDMA_ModuloDisable;
	edma_tc_description.enableChannelMinorLoopLink=false;
	edma_tc_description.enableChannelMajorLoopLink=false;
	edma_tc_description.srcTransferSize=kEDMA_TransferSize1Bytes;
	edma_tc_description.destTransferSize=kEDMA_TransferSize1Bytes;
	edma_tc_description.enableDstMinorLoopOffset = false;
	edma_tc_description.enableSrcMinorLoopOffset = false;
	edma_tc_description.dstMajorLoopOffset = 0;
	edma_tc_description.srcMajorLoopOffset = 0;

	// TCD triggered by SW configuration.
	edma_tc_description.srcAddr=(uint32_t)tx_buf;
	edma_tc_description.srcOffset=1;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=2;
	edma_tc_description.majorLoopCounts=1;
	edma_tc_description.enabledInterruptMask=0;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_cmd);
	EDMA_ConfigChannelSoftwareTCD(&tcd_cmd, &edma_tc_description);

	// TCD triggered by Rx Flexcomm request for dummyRx (link to tcd_rx).
	edma_tc_description.srcAddr=RxSpi1Adr;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=(uint32_t)&dummyRx;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=1;
	edma_tc_description.majorLoopCounts=2;
	edma_tc_description.enabledInterruptMask= 0;
	edma_tc_description.linkTCD = &tcd_rxEven;
	EDMA_TcdReset(&tcd_rxDummy);
	EDMA_ConfigChannelSoftwareTCD(&tcd_rxDummy, &edma_tc_description);

	// TCD triggered by DRDY.
	edma_tc_description.srcAddr=(uint32_t)&dummyTx;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_txDummy;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_txDummy;
	edma_tc_description.enabledInterruptMask=tcd_txDummy_Interrupt;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_txDummy);
	EDMA_ConfigChannelSoftwareTCD(&tcd_txDummy, &edma_tc_description);

	// TCD triggered by Tx FlexComm request, this is started only when Major loop of tcd_txDummy expire.
	edma_tc_description.srcAddr=(uint32_t)&dummyTx;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=TxSpi1Adr;
	edma_tc_description.destOffset=0;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_txDummy2;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_txDummy2;
	edma_tc_description.enabledInterruptMask= 0;
	edma_tc_description.linkTCD = NULL;
	EDMA_TcdReset(&tcd_txDummy2);
	EDMA_ConfigChannelSoftwareTCD(&tcd_txDummy2, &edma_tc_description);

	// TCD triggered by Rx Flexcomm request for store the Rx bytes (start when Major loop of tcd_rxDummy expire).
	edma_tc_description.srcAddr=RxSpi1Adr;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=(uint32_t)&rx_bufEven[0];
	edma_tc_description.destOffset=1;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_rx;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_rx;
	edma_tc_description.enabledInterruptMask= kEDMA_MajorInterruptEnable;
	edma_tc_description.linkTCD = &tcd_rxOdd;
	EDMA_TcdReset(&tcd_rxEven);
	EDMA_ConfigChannelSoftwareTCD(&tcd_rxEven, &edma_tc_description);

	// TCD triggered by Rx Flexcomm request for store the Rx bytes (start when Major loop of tcd_rxDummy expire).
	edma_tc_description.srcAddr=RxSpi1Adr;
	edma_tc_description.srcOffset=0;
	edma_tc_description.destAddr=(uint32_t)&rx_bufOdd[0];
	edma_tc_description.destOffset=1;
	edma_tc_description.minorLoopBytes=MinorLoopCount_tcd_rx;
	edma_tc_description.majorLoopCounts=MajorLoopCount_tcd_rx;
	edma_tc_description.enabledInterruptMask= kEDMA_MajorInterruptEnable;
	edma_tc_description.linkTCD = &tcd_rxEven;
	EDMA_TcdReset(&tcd_rxOdd);
	EDMA_ConfigChannelSoftwareTCD(&tcd_rxOdd, &edma_tc_description);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxCmd, &tcd_cmd);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxCmd, true);

	// Install TCD and Disable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHRx, &tcd_rxDummy);
	EDMA_EnableAutoStopRequest(DMASPI1, 0, false);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxDummy, &tcd_txDummy);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxDummy, false);

	// Install TCD and Enable Auto Stop Auto Mode.
	EDMA_InstallTCD(DMASPI1, DMASPI1_CHTxDummy2, &tcd_txDummy2);
	EDMA_EnableAutoStopRequest(DMASPI1, DMASPI1_CHTxDummy2, true);

	EnableIRQ(EDMA_0_CH0_IRQn);//IRQ needed to sync with received samples.
	EnableIRQ(EDMA_0_CH2_IRQn);//IRQ needed to start tcd_txDummy2 if needed.

	// Clear all interrupt flag for all DMA CH.
	EDMA_ClearChannelStatusFlags(DMA0,0,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,1,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,2,kEDMA_InterruptFlag);
	EDMA_ClearChannelStatusFlags(DMA0,3,kEDMA_InterruptFlag);

	// Enable DMA for LPSPI1.
	LPSPI_EnableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_RxDmaEnable);
	LPSPI_EnableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_TxDmaEnable);

	// Set PCS in continuos mode, CS remain low till the end of trasmission.
	LPSPI_SetPCSContinous(LP_FLEXCOMM1_PERIPHERAL,1);

	EDMA_StartTransfer(&LP_FLEXCOMM1_RX_Handle);
	EDMA_StartTransfer(&LP_FLEXCOMM1_TXDummy_Handle);
	EDMA_TriggerChannelStart(DMASPI1, DMASPI1_CHTxCmd);

	int ret; 
	ret = NAFE113x8_CaptureSamplesMCCR(activeChannelCount,false,false,count);

	// Set PCS at the end of trasmission.
	LPSPI_SetPCSContinous(LP_FLEXCOMM1_PERIPHERAL,0);
	// Stop the DMA channel, the only channel with the autostop disable.
	EDMA_StopTransfer(&LP_FLEXCOMM1_TXDummy_Handle);
	EDMA_StopTransfer(&LP_FLEXCOMM1_RX_Handle);
	NAFE113x8_WriteCommand(CMD_ADC_ABORT,0);
	// Disable DMA for LPSPI1.
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_RxDmaEnable);
	LPSPI_DisableDMA(LP_FLEXCOMM1_PERIPHERAL,kLPSPI_TxDmaEnable);
	DisableIRQ(EDMA_0_CH0_IRQn);
	DisableIRQ(EDMA_0_CH2_IRQn);
	//Clear Flag
	SampleReceived = false;
	return ret;
}

void clearReceivedFlag(void){
	SampleReceived = false;
}

bool getReceivedFlag(void){
	return SampleReceived;
}

void GPIO00_IRQHandler(void){
	GPIO0->ISFR[0] = 1UL << 30;
	SampleReceived = true;
}


void EDMA_0_CH0_IRQHandler(void){
	DMA_CLEAR_INT_STATUS(DMASPI1, DMASPI1_CHRx);
	SampleReceived = true;
}

void EDMA_0_CH2_IRQHandler(void){
	DMA_CLEAR_INT_STATUS(DMASPI1, DMASPI1_CHTxDummy);
	EDMA_StartTransfer(&LP_FLEXCOMM1_TXDummy2_Handle);
}



